import { useState, useEffect } from "react";
import { useRouter } from "next/router";
import Header from "../components/Header";
import Footer from '../components/Footer'

export default function About() {
  const [data, setData] = useState(null);
  const [isLoading, setLoading] = useState(false);

  const router = useRouter();
  const { locale } = router;

  useEffect(() => {
    fetch(`https://vox-dashboard.ra-devs.tech/api/wppages`)
      .then((res) => res.json())
      .then((data) => {
        setData(data);
        setLoading(false);
      });
  }, []);

  const textPh = `<p>VoxCheck — це український фактчекінговий проєкт. Із 2018 року VoxCheck є підписантом Кодексу етики Міжнародної мережі фактчекерів Інституту Пойнтера (IFCN) — найбільшої професійної спільноти фактчекерів у світі. А також членом фактчекінгової програми Meta, у рамках якої ми маркуємо та спростовуємо неправдивий контент, який поширюють користувачі платформи. </p>

  <p>З 24 лютого 2022 року російська пропаганда очікувано опинилась у ще більшому фокусі нашої команди. Тому за фінансової підтримки Європейського Союзу ми вирішили зробити <strong>базу фейків воєнного часу</strong>. У цій базі ми зібрали усі фейки, повʼязані із війною росії проти України, які поширювались після 24 лютого 2022 року. Наша мета — систематизувати усю неправдиву інформацію, що поширюється про Україну протягом повномасштабного вторгнення рф. База буде корисним інструментом для журналістів, дослідників та усіх зацікавлених у темі.</p>
  
  <p>Кожен матеріал має свій <strong>вердикт</strong>:</p>
  
  <ul>
      <li>НЕПРАВДА: Інформація повністю неправдива, є дані, які підтверджують протилежні тези, ніж зазначені у джерелі. Спростувати цю інформацію можна «дзеркальним (або ж чітко протилежним) фактом». </li>
      <li>ФЕЙК: Інформація вигадана, неправдива. «Дзеркального» факту для спростування немає, але є інші дані, які підтверджують, що це хибна інформація. </li>
      <li>МАНІПУЛЯЦІЯ: Інформація або дані правдиві, але подані у спотвореному контексті або не повністю. Неправильне трактування даних використовують, щоб проілюструвати хибну ідею або схилити користувачів до неправильних висновків.</li>
      <li>БЕЗПІДСТАВНО: Інформація не ґрунтується на будь-яких правдивих фактах, дослідженнях чи відкритих даних. Однак немає достатньо даних, щоб впевнено сказати, що це неправда.</li>
      <li>БЕЗДОКАЗОВО: Інформація на основі власних висновків чи логічних хиб, а не наукових доказів.</li>
      <li>ОБЕРЕЖНО, ШАХРАЇ: Інформація про шахрайські схеми, які використовують, щоб ввести користувачів в оману та отримати доступ до персональних даних.</li>
      <li>САТИРА: Інформацію вигадали з розважальною метою, однак не всі користувачі можуть легко ідентифікувати, що це сатира, а не правда.</li>
      <li>ВІДЕОФЕЙК: Відео відредаговане, щоб створити хибне враження.</li>
      <li>ФОТОФЕЙК: Фото відредаговане, щоб створити хибне враження.</li>
      <li>КОНСПІРОЛОГІЯ: Теорії змови.</li>
  </ul>
  
  <p><strong>Як працює VoxCheck?</strong></p>
  
  <p>‍В основі — методика «натисни та перевір». Усе прозоро. Кожен може перевірити нашу аргументацію та джерела. Якість перевірок забезпечує редакційна колегія проєкту. Кожну публікацію мають схвалити два члени редколегії.</p>
  
  <p><strong>Незалежність VoxCheck</strong></p>
  
  <p>У березні 2018 VoxCheck приєднався до <a href="https://ifcncodeofprinciples.poynter.org/" rel="noopener" target="_blank">Кодексу етики Міжнародної мережі фактчекерів</a>. Це означає, що VoxCheck дотримується таких принципів:</p>
  
  <p><strong>Принципи незалежності та обʼєктивності</strong></p>
  
  <p>Ми перевіряємо твердження з використанням одного й того стандарту для всіх матеріалів. Ми не концентруємося на перевірці фактів лише однієї сторони. Ми перевіряємо за одним й тим самим методом і робимо висновки лише на основі фактів. Ми не відстоюємо чиюсь політичну позицію щодо питань, які ми перевіряємо.</p>
  
  <p><strong>Принцип прозорості методології</strong></p>
  
  <p>‍Ми пояснюємо методологію, яку ми використовуємо для вибору, дослідження, написання, редагування, опублікування перевірок та виправлення фактів. Ми заохочуємо наших читачів надсилати нам заяви на перевірку фактів і ми є прозорими щодо того, чому і як ми перевіряємо факти.</p>
  
  <p><strong>Принцип прозорості джерел</strong></p>
  
  <p>‍Ми хочемо, щоб наші читачі могли самостійно перевірити наші висновки. Тому ми надаємо всі джерела для перевірки достатньо детально, щоб читачі могли відтворити нашу роботу, за винятком випадків, коли особиста безпека джерела може бути скомпрометована. У таких випадках ми надаємо максимально докладну інформацію.</p>
  
  <p><strong>Принцип прозорості фінансування та організації</strong></p>
  
  <p>‍Ми прозорі щодо наших джерел фінансування. Якщо ми приймаємо кошти від інших організацій, ми гарантуємо, що спонсори не впливають на висновки фактчеку. Ми деталізуємо професійний досвід всіх ключових фігур у нашій організації та пояснюємо нашу організаційну структуру та правовий статус. Ми чітко вказуємо для читачів, як можна зв’язатися з нами.</p>
  
  <p><strong>Принцип прозорого та відкритого визнання помилок</strong></p>
  
  <p>‍Ми розкриваємо нашу політику щодо виправлень та уважно дотримуємося її. Ми чітко та прозоро виправляємо факти у наших перевірках відповідно до нашої політики виправлень та робимо це так, щоб читачі побачили виправлену версію.</p>
  
  <p><em>Цю базу підготовлено за фінансової підтримки Європейського Союзу. Її вміст є виключною відповідальністю VoxCheck і не обов’язково відображає погляди Європейського Союзу.</em></p>`

  const titleLang = locale == "ua" ? "title" : "title_ru";
  const contentLang = locale == "ua" ? "content" : "content_ru";

  return (
    <div className="w-full">
      <Header />
      <div className="mx-16 my-8 flex flex-col justify-center">
        <h1 className="mb-8 text-[26px]">
          {data && (
            <div
              dangerouslySetInnerHTML={{ __html: data.data[0][titleLang] }}
            />
          )}
        </h1>
        {data && (
          <div
            dangerouslySetInnerHTML={{ __html: data.data[0][contentLang] }}
          />
        )}
      </div>
      <Footer />
    </div>
  );
}
